Tekla Open API Reference for Tekla Structures 2025
ViewHandler.GetPermanentViews Method
Returns the permanent views.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModelViewEnumerator GetPermanentViews()
Public Shared Function GetPermanentViews As ModelViewEnumerator
Return Value
Type: ModelViewEnumerator
A model view enumerator with the permanent views.
See Also
Reference
ViewHandler Class
Tekla.Structures.Model.UI Namespace